{
"format": "layers-model",
"generatedBy": "keras v3.8.0",
"convertedBy": "TensorFlow\.js Converter v4.22.0",
"modelTopology": {
"keras\_version": "3.8.0",
"backend": "tensorflow",
"model\_config": {
"class\_name": "Sequential",
"config": {
"name": "sequential",
"trainable": true,
"dtype": {
"module": "keras",
"class\_name": "DTypePolicy",
"config": { "name": "float32" },
"registered\_name": null
},
"layers": \[
{
"class\_name": "InputLayer",
"config": {
"batch\_shape": \[null, 512],
"batch\_input\_shape": \[null, 512],
"dtype": "float32",
"sparse": false,
"name": "input\_layer"
}
},
{
"class\_name": "Dense",
"config": {
"name": "dense",
"trainable": true,
"dtype": {
"module": "keras",
"class\_name": "DTypePolicy",
"config": { "name": "float32" },
"registered\_name": null
},
"units": 256,
"activation": "relu",
"use\_bias": true,
"kernel\_initializer": {
"module": "keras.initializers",
"class\_name": "GlorotUniform",
"config": { "seed": null },
"registered\_name": null
},
"bias\_initializer": {
"module": "keras.initializers",
"class\_name": "Zeros",
"config": {},
"registered\_name": null
},
"kernel\_regularizer": null,
"bias\_regularizer": null,
"kernel\_constraint": null,
"bias\_constraint": null
}
},
{
"class\_name": "BatchNormalization",
"config": {
"name": "batch\_normalization",
"trainable": true,
"dtype": {
"module": "keras",
"class\_name": "DTypePolicy",
"config": { "name": "float32" },
"registered\_name": null
},
"axis": -1,
"momentum": 0.99,
"epsilon": 0.001,
"center": true,
"scale": true,
"beta\_initializer": {
"module": "keras.initializers",
"class\_name": "Zeros",
"config": {},
"registered\_name": null
},
"gamma\_initializer": {
"module": "keras.initializers",
"class\_name": "Ones",
"config": {},
"registered\_name": null
},
"moving\_mean\_initializer": {
"module": "keras.initializers",
"class\_name": "Zeros",
"config": {},
"registered\_name": null
},
"moving\_variance\_initializer": {
"module": "keras.initializers",
"class\_name": "Ones",
"config": {},
"registered\_name": null
},
"beta\_regularizer": null,
"gamma\_regularizer": null,
"beta\_constraint": null,
"gamma\_constraint": null,
"synchronized": false
}
},
{
"class\_name": "Dropout",
"config": {
"name": "dropout",
"trainable": true,
"dtype": {
"module": "keras",
"class\_name": "DTypePolicy",
"config": { "name": "float32" },
"registered\_name": null
},
"rate": 0.4,
"seed": null,
"noise\_shape": null
}
},
{
"class\_name": "Dense",
"config": {
"name": "dense\_1",
"trainable": true,
"dtype": {
"module": "keras",
"class\_name": "DTypePolicy",
"config": { "name": "float32" },
"registered\_name": null
},
"units": 128,
"activation": "relu",
"use\_bias": true,
"kernel\_initializer": {
"module": "keras.initializers",
"class\_name": "GlorotUniform",
"config": { "seed": null },
"registered\_name": null
},
"bias\_initializer": {
"module": "keras.initializers",
"class\_name": "Zeros",
"config": {},
"registered\_name": null
},
"kernel\_regularizer": null,
"bias\_regularizer": null,
"kernel\_constraint": null,
"bias\_constraint": null
}
},
{
"class\_name": "BatchNormalization",
"config": {
"name": "batch\_normalization\_1",
"trainable": true,
"dtype": {
"module": "keras",
"class\_name": "DTypePolicy",
"config": { "name": "float32" },
"registered\_name": null
},
"axis": -1,
"momentum": 0.99,
"epsilon": 0.001,
"center": true,
"scale": true,
"beta\_initializer": {
"module": "keras.initializers",
"class\_name": "Zeros",
"config": {},
"registered\_name": null
},
"gamma\_initializer": {
"module": "keras.initializers",
"class\_name": "Ones",
"config": {},
"registered\_name": null
},
"moving\_mean\_initializer": {
"module": "keras.initializers",
"class\_name": "Zeros",
"config": {},
"registered\_name": null
},
"moving\_variance\_initializer": {
"module": "keras.initializers",
"class\_name": "Ones",
"config": {},
"registered\_name": null
},
"beta\_regularizer": null,
"gamma\_regularizer": null,
"beta\_constraint": null,
"gamma\_constraint": null,
"synchronized": false
}
},
{
"class\_name": "Dropout",
"config": {
"name": "dropout\_1",
"trainable": true,
"dtype": {
"module": "keras",
"class\_name": "DTypePolicy",
"config": { "name": "float32" },
"registered\_name": null
},
"rate": 0.3,
"seed": null,
"noise\_shape": null
}
},
{
"class\_name": "Dense",
"config": {
"name": "dense\_2",
"trainable": true,
"dtype": {
"module": "keras",
"class\_name": "DTypePolicy",
"config": { "name": "float32" },
"registered\_name": null
},
"units": 1,
"activation": "sigmoid",
"use\_bias": true,
"kernel\_initializer": {
"module": "keras.initializers",
"class\_name": "GlorotUniform",
"config": { "seed": null },
"registered\_name": null
},
"bias\_initializer": {
"module": "keras.initializers",
"class\_name": "Zeros",
"config": {},
"registered\_name": null
},
"kernel\_regularizer": null,
"bias\_regularizer": null,
"kernel\_constraint": null,
"bias\_constraint": null
}
}
],
"build\_input\_shape": \[null, 512]
}
}
},
"training\_config": {
"loss": "binary\_crossentropy",
"loss\_weights": null,
"metrics": \[
"accuracy",
{ "class\_name": "AUC", "config": { "name": "auc", "dtype": "float32", "num\_thresholds": 200, "curve": "ROC", "summation\_method": "interpolation", "multi\_label": false, "num\_labels": null, "label\_weights": null, "from\_logits": false } }
],
"weighted\_metrics": null,
"run\_eagerly": false,
"steps\_per\_execution": 1,
"jit\_compile": false,
"optimizer\_config": {
"class\_name": "Adam",
"config": {
"name": "adam",
"learning\_rate": 0.0002500000118743628,
"weight\_decay": null,
"clipnorm": null,
"global\_clipnorm": null,
"clipvalue": null,
"use\_ema": false,
"ema\_momentum": 0.99,
"ema\_overwrite\_frequency": null,
"loss\_scale\_factor": null,
"gradient\_accumulation\_steps": null,
"beta\_1": 0.9,
"beta\_2": 0.999,
"epsilon": 1e-07,
"amsgrad": false
}
}
},
"weightsManifest": \[
{
"paths": \["group1-shard1of1.bin"],
"weights": \[
{ "name": "sequential/batch\_normalization/gamma", "shape": \[256], "dtype": "float32" },
{ "name": "sequential/batch\_normalization/beta", "shape": \[256], "dtype": "float32" },
{ "name": "sequential/batch\_normalization/moving\_mean", "shape": \[256], "dtype": "float32" },
{ "name": "sequential/batch\_normalization/moving\_variance", "shape": \[256], "dtype": "float32" },
{ "name": "sequential/batch\_normalization\_1/gamma", "shape": \[128], "dtype": "float32" },
{ "name": "sequential/batch\_normalization\_1/beta", "shape": \[128], "dtype": "float32" },
{ "name": "sequential/batch\_normalization\_1/moving\_mean", "shape": \[128], "dtype": "float32" },
{ "name": "sequential/batch\_normalization\_1/moving\_variance", "shape": \[128], "dtype": "float32" } 
]
  }
]
}
